{
  "name": "Аэроинтерфейс",
  "icon": "pneumaticcraft:aerial_interface",
  "category": "pneumaticcraft:machines",
  "advancement": "pneumaticcraft:advanced_pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Аэроинтерфейс/$ - это очень мощное устройство, которое может напрямую соединяться с инвентарем игрока. Когда он достаточно $(l:base_concepts/pressure)наполнен/$, с ним можно взаимодействовать как с любым другим инвентарем. Вместо того, чтобы падать в интерфейс, предметы отправляются $(italic)прямо/$ в инвентарь игрока. Например, вы можете использовать $(l:logistics/frames#requester)Рамку логистического запроса/$ на интерфейсе, чтобы всегда иметь под рукой 64 факела."
    },
    {
      "type": "text",
      "text": "По умолчанию главный инвентарь доступен через любую боковую грань интерфейса, а слоты брони доступны через верхнюю или нижнюю грани. Однако это можно перенастроить через вкладку $(bold)Настройка стороны/$ в интерфейсе GUI.$(p)Вы можете соединить каждую грань с:$(li)Главным инвентарем$(li)Слотами брони$(li)Слотом дополнительного оружия$(li)Конечным инвентарем (как доступным в обычных $(item)Эндер сундуках/$)."
    },
    {
      "type": "text",
      "title": "Дыхание под водой",
      "text": "Очевидно, что если у нас есть что-то, что может соединяться с игроком и работает на $(l:base_concepts/pressure)воздухе/$, должно быть что-то, что позволяет нам передавать этот воздух по необходимости, верно? За 80мл/тик вы можете дышать бесконечно под водой.$(p)Это немного эффективнее $(l:armor/pneumatic_helmet)пневматической шапки/$ с $(l:base_concepts/upgrades#scuba)модификацией SCUBA/$, но не обеспечивает четкого подводного обзора."
    },
    {
      "type": "text",
      "title": "Интерфейс для энергии Forge",
      "text": "$(item)Аэроинтерфейс/$ принимает $(thing)энергию Forge/$ (совместимую с энергией RF и энергией от многих других модов). Энергия, хранящаяся в его внутреннем буфере (100 000), используется для зарядки любого предмета в инвентаре игрока (и слотах брони)."
    },
    {
      "type": "text",
      "title": "Автоматическое питание",
      "text": "Установив $(l:base_concepts/upgrades#dispenser)модификацию диспенсера/$, вы можете сделать $(item)аэроинтерфейс/$ дистанционным автоматическим кормильцем. Интерфейс принимает только пищевые предметы, и только когда вы достаточно голодны, чтобы полностью использовать предоставленный прием пищи. Обратите внимание, что когда инвентарь предлагает стопку предметов >1, интерфейс ждет, пока вы сможете употребить всю стопку. Чтобы убедиться, что можно использовать наименьшее количество пищи, используйте медленные механизмы вставки, такие как $(item)Воронки/$."
    },
    {
      "type": "text",
      "title": "Обращение с опытом",
      "text": "$(l:base_concepts/upgrades#dispenser)Модификация диспенсера/$ также позволяет перекачивать $(thing)жидкости опыта/$ в интерфейс или из него. Когда существует несколько типов жидкостей опыта, вы можете выбрать, какую использовать во вкладке $(bold)Опыт/$ в GUI. Эта вкладка также показывает, какие жидкости опыта из других модов были обнаружены и доступны для использования. $(l:base_concepts/memory_essence)Сущность памяти/$ всегда доступна для использования."
    },
    {
      "type": "text",
      "title": "Обращение с опытом (продолжение)",
      "text": "Обратите внимание, что интерфейс не имеет внутреннего буфера для жидкости; он использует ваш опыт непосредственно в качестве 'резервуара'. Это означает, что при перекачке опыта в или из интерфейса вам нужно устройство, способное переносить жидкости с скоростью, превышающей количество жидкости опыта за одно единицу опыта. На момент написания скорость этой передачи составляет 20мл/тик для всех известных жидкостей опыта."
    },
    {
      "type": "text",
      "title": "Автоматическая зарядка",
      "text": "Направив $(l:tubes/charging_module)модуль зарядки/$ на $(item)аэроинтерфейс/$, вы можете заряжать любые $(l:base_concepts/pressure)предметы, поддерживающие давление/$ в вашем инвентаре. Обратите внимание, что для зарядки надетых $(l:armor/overview)пневматических предметов/$ необходимо направить модуль зарядки на сторону интерфейса, которая подключена к слотам брони."
    },
    {
      "type": "crafting",
      "text": "Крафт аэроинтерфейса",
      "recipe": "pneumaticcraft:aerial_interface"
    }
  ]
}
