{
  "name": "Плитка афоризмов",
  "icon": "pneumaticcraft:aphorism_tile",
  "category": "pneumaticcraft:machines",
  "advancement": "pneumaticcraft:assembly_controller",
  "pages": [
    {
      "type": "text",
      "text": "$(thing)Плитки афоризмов/$ похожи на $(item)Таблички/$, но они могут отображать произвольные тексты. Любой текст автоматически масштабируется, чтобы полностью поместиться на плитке.$(p)Когда вы размещаете плитку афоризма, она $(ttcolor)$(t:Это можно отключить в клиентской конфигурации - см. 'B:dramaSplash')по умолчанию/$ показывает случайный текст из $(l:http://mc-drama.herokuapp.com/)Генератора Драмы/$."
    },
    {
      "type": "text",
      "text": "$(li)$(item)Плитки афоризмов/$ можно редактировать на месте, выполнив $(thing)щелчок правой кнопкой мыши/$ с пустой рукой.$(li)Можно добавлять разметку, используя $(thing)Alt + 0-9/a-f/l/m/n/o/r/$ ($(l:https://minecraft.gamepedia.com/Formatting_codes)стандартные коды форматирования Minecraft/$).$(li)Удерживая $(thing)F1/$, появится всплывающая подсказка с описанием сочетаний клавиш для редактора.$(li)$(item)Плитки афоризмов/$ можно окрашивать, выполнив $(thing)щелчок правой кнопкой мыши/$ с предметом красителя. Цвет границы и фона плитки можно окрашивать независимо, кликнув в соответствующую область плитки."
    },
    {
      "type": "text",
      "anchor": "items",
      "text": "$(li)$(item)Плитки афоризмов/$ также могут отображать $(thing)предметы/$ вместо текста или в сочетании с ним. Вы можете указать предмет для отображения, написав (на отдельной строке) текст в формате $(thing){item:<modid>:<itemid>}/$, например $(thing){item:minecraft:diamond}/$.$(li)В противном случае, нажмите кнопку $(thing)Вставить предмет.../$ в левой панели GUI и выберите предмет из всплывающего окна поиска. Это заменит весь текст на текущей строке. Вы можете отображать несколько предметов на одной плитке."
    },
    {
      "type": "text",
      "text": "$(li)Совет: отображаемые предметы масштабируются по высоте строк текста. Если вы используете текст и предметы вместе, старайтесь делать строки текста короткими, чтобы избежать маленьких предметов.$(li)Вы также можете использовать ползунок в левой панели GUI для установки $(thing)отступа/$ для текста на плитке, если хотите уменьшить его размер на плитке.$(li)Наконец, вы можете использовать флажок в левой панели GUI, чтобы сделать всю плитку $(thing)невидимой/$, так чтобы показывался $(italic)только/$ текст (и/или предметы)."
    },
    {
      "type": "text",
      "text": "$(li)Невидимые плитки афоризмов совсем не имеют формы блока, если вы не присесть. Поэтому они могут использоваться в качестве ярлыков для сундуков, особенно при отображении предметов. Поскольку у них нет формы, любые взаимодействия передаются блоку сзади - например, щелчок правой кнопкой мыши по сундуку.$(li)Невидимые плитки можно редактировать, присесть и щелкнуть правой кнопкой мыши на них (с пустой рукой, как обычно)."
    },
    {
      "type": "pneumaticcraft:assembly_system",
      "recipe": "pneumaticcraft:assembly/aphorism_tile"
    }
  ]
}
