{
  "name": "Газлифт",
  "icon": "pneumaticcraft:gas_lift",
  "category": "pneumaticcraft:machines",
  "advancement": "pneumaticcraft:pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Газлифт/$ - это, по сути, насос. Он использует $(l:base_concepts/pressure)давление/$ для уменьшения плотности жидкости, чтобы принудить её двигаться вверх.$(p)Когда он находится под давлением, он выдвигает $(l:components/drill_pipe)Бурильные трубы/$ (которые вы должны предоставить) вниз, пока они не попадут в блок жидкости, после чего он будет откачивать её. Это идеально подходит для добычи $(l:base_concepts/oil)нефти/$, так как нефть может находиться глубоко под землёй."
    },
    {
      "type": "text",
      "text": "Любой твёрдый блок на пути будет сломан, но без добычи. Ломание блоков потребляет воздух; для мягких блоков, таких как земля или песок, это очень маленькое количество, но для твёрдых блоков, таких как обсидиан, гораздо больше.$(p)Минимальное давление, необходимое для откачки жидкости, линейно зависит от глубины, на которой происходит откачка, то есть от количества выдвинутых $(item)Бурильных труб/$, до максимума в 4,9 бар."
    },
    {
      "type": "text",
      "title": "Вкладка Режимов",
      "text": "Газлифт можно переключить на один из 3 режимов:$(li)$(#00f)Откачивать и оставлять пустой бак/$ - выдвигает бурильные трубы, откачивая жидкость, когда она встречается на пути.$(li)$(#00f)Откачивать и оставлять жидкость в фильтре/$ - делает то же самое, что и выше, но всегда оставляет 1000 мБ жидкости в баке. Это полезно, когда вы откачиваете конкретную жидкость, чтобы убедиться, что другая жидкость не будет откачиваться."
    },
    {
      "type": "text",
      "text": "$(li)$(#00f)Втягивать бурильные трубы/$ - заставляет $(thing)Газлифт/$ прекратить откачку и втянуть обратно в инвентарь все выдвинутые бурильные трубы."
    },
    {
      "type": "crafting",
      "text": "Крафт Газлифта",
      "recipe": "pneumaticcraft:gas_lift"
    }
  ]
}
