{
  "name": "Умный сундук",
  "icon": "pneumaticcraft:smart_chest",
  "category": "pneumaticcraft:machines",
  "advancement": "pneumaticcraft:printed_circuit_board",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Умный сундук/$ - это сундук на 72 слота, который (как его младший брат $(l:machines/reinforced_chest)Укрепленный сундук/$) имеет стойкость к взрыву, сравнимую с обсидианом, и сохраняет свой инвентарь после разрушения. Однако у него есть и другие очень мощные возможности..."
    },
    {
      "type": "text",
      "title": "Фильтрация слотов",
      "text": "$(li)Если вы $(thing)Alt+Левый клик/$ по слоту с предметом, Умный сундук начнет фильтровать этот слот, чтобы принимать только этот предмет.$(li)Вы можете $(thing)Alt+Левый клик/$ по уже отфильтрованному слоту, чтобы снова убрать фильтрацию.$(li)Если вы $(thing)Alt+Левый клик/$ по пустому слоту, этот слот и все последующие слоты будут закрыты, что фактически уменьшит размер инвентаря.$(li)Если вы $(thing)Alt+Левый клик/$ по первому закрытому слоту, все закрытые слоты будут снова открыты."
    },
    {
      "type": "text",
      "title": "Перемещение предметов",
      "text": "Каждая сторона Умного сундука может быть настроена отдельно на перемещение предметов, забор предметов или ничего не делать (по умолчанию). Чтобы настроить стороны, откройте вкладку $(thing)Side Configuration/$ в интерфейсе.$(p)Стороны, настроенные на перемещение предметов, будут пытаться отправлять предметы из Умного сундука в смежный инвентарь на этой стороне. При установке $(item)Модификатора раздачи/$, сундук будет выбрасывать предметы на землю, если смежный инвентарь отсутствует."
    },
    {
      "type": "text",
      "title": "Забор предметов",
      "text": "Стороны, настроенные на забор предметов, будут пытаться забирать предметы из смежного инвентаря на этой стороне.$(p)Если установить $(l:base_concepts/upgrades#magnet)Магнитный модификатор/$, сундук сможет притягивать предметы находящиеся на земле рядом. Это работает только для сторон, которые настроены на забор предметов; область забора по умолчанию - это 3x3x3 куб рядом со стороной, но ее можно увеличить с помощью $(l:base_concepts/upgrades#range)Модификаторов дальности/$."
    },
    {
      "type": "crafting",
      "text": "Крафт умного сундука",
      "recipe": "pneumaticcraft:smart_chest"
    }
  ]
}
