{
  "name": "Ёмкости",
  "icon": "pneumaticcraft:small_tank",
  "category": "pneumaticcraft:machines",
  "advancement": "pneumaticcraft:root",
  "pages": [
    {
      "type": "text",
      "text": "Есть четыре типа ёмкостей для жидкости, оригинально названных $(item)Малая ёмкость/$, $(item)Средняя ёмкость/$, $(item)Большая ёмкость/$ и $(item)Огромная ёмкость/$. Хотя $(l:machines/liquid_hopper)Жидкостные загрузчики/$ тоже подходят для хранения жидкостей, эти ёмкости обеспечивают более плотное хранение и некоторую удобную функциональность стеклинга, и не автоматически перекачивают жидкости (хотя могут перемещать жидкости, если добавить $(l:base_concepts/upgrades#dispenser)Обновление выдачи/$)."
    },
    {
      "type": "text",
      "title": "Стеклинг",
      "text": "Все четыре типа ёмкостей могут быть $(thing)стеклены/$ вертикально друг с другом и сформированы в своего рода мультиблок. Для этого щелкните правой кнопкой мыши по ёмкости с помощью $(l:tools/pneumatic_wrench)Гаечного ключа/$; если вы щелкнете по верхней половине ёмкости, она попытается соединиться с верхней ёмкостью, а наоборот, если щелкнете по нижней ёмкости, она соединится с нижней.$(p)После того, как ёмкости стеклены, любая жидкость в $(ttcolor)$(t:Если плотность жидкости < 0, она будет перемещаться вверх, а не вниз)верхних ёмкостях/$ автоматически перетечет в нижние ёмкости, если там есть место."
    },
    {
      "type": "image",
      "images": [
        "pneumaticcraft:textures/patchouli/small_tanks.png"
      ],
      "border": "true",
      "text": "Три стекленные Малые ёмкости"
    },
    {
      "type": "text",
      "text": "Есть некоторые ограничения:$(li)Чтобы объединить две ёмкости, они должны содержать одну и ту же жидкость (или не содержать жидкости вовсе), или одна из ёмкостей должна быть пустой$(li)Жидкость $(italic)не/$ будет двигаться вверх; поэтому жидкость следует перекачивать в верхнюю ёмкость стека и перекачивать из нижней ёмкости для наилучших результатов$(li)Интерфейс ёмкости покажет только количество жидкости в ёмкости, по которой был сделан щелчок правой кнопкой мыши."
    },
    {
      "type": "crafting",
      "recipe": "pneumaticcraft:small_tank",
      "recipe2": "pneumaticcraft:medium_tank"
    },
    {
      "type": "crafting",
      "recipe": "pneumaticcraft:large_tank",
      "recipe2": "pneumaticcraft:huge_tank"
    }
  ]
}
