{
    "name": "Модуль Регулятора",
    "icon": "pneumaticcraft:regulator_tube_module",
    "category": "pneumaticcraft:tubes",
    "advancement": "pneumaticcraft:pressure_tube",
    "pages": [{
            "type": "text",
            "text": "Модуль Регулятора для труб является $(l:tubes/tube_modules#inline)встроенным/$ модулем, используемым для ограничения $(l:base_concepts/pressure)давления/$ в трубе. По умолчанию модуль регулирует давление до 4.9 бара (для базовых и усовершенствованных труб) без сигнала красного камня, уменьшаясь до 0 при возрастании сигнала до 15. Это означает, что рычаг, расположенный рядом с регулятором, закрывает его, предотвращая протекание воздуха через него."
        },
        {
            "type": "text",
            "text": "Когда узкий конец регулятора достигает этого давления, через трубу больше не пропускается воздух. Этот принцип можно использовать как $(thing)трансформатор/$: на входе (широкой стороне) высокое давление воздуха, но Модуль Регулятора ограничивает давление на выходе до порогового давления.$(p)Это позволяет безопасно подавать сеть труб более низкого уровня из сети труб более высокого уровня."
        },
        {
            "type": "text",
            "text": "Интересно, что $(thing)Модуль Регулятора/$ позволяет неограниченное движение воздуха в противоположном направлении (с узкой стороны на широкую сторону), независимо от сигнала красного камня; это означает, что регулятор с полным сигналом красного камня можно использовать как односторонний клапан.$(p)Обратите внимание, что $(thing)Регулятор/$ $(italic)не/$ активно снижает давление на своей узкой стороне; он только предотвращает поток воздуха, если давление возрастет выше порога."
        },
        {
            "type": "spotlight",
            "item": "pneumaticcraft:module_expansion_card",
            "text": "Установка $(l:tubes/module_expansion_card)карты расширения модуля/$ к Модулю Регулятора открывает интерфейс, который обеспечивает гораздо больше возможностей для контроля над пороговым уровнем. Вы можете установить точный пороговый уровень в интерфейсе или (с помощью флажка $(bold)Расширенная Настройка/$) настроить интерполированные уровни порога на основе сигнала красного камня. Это работает точно так же, как $(l:tubes/safety_module)Модуль Безопасности/$."
        },
        {
            "type": "crafting",
            "text": "Крафт Модуля Регулятора",
            "recipe": "pneumaticcraft:regulator_tube_module"
        }
    ]
}