{
  "name": "Электростатический Компрессор",
  "icon": "pneumaticcraft:electrostatic_compressor",
  "category": "pneumaticcraft:compressors",
  "advancement": "pneumaticcraft:advanced_pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Электростатический Компрессор/$ - это компрессор $(l:base_concepts/pressure_tiers)второго уровня/$, который использует $(thing)молнию/$ для получения энергии и сжатия воздуха.$(p)Когда его поражает молния, он мгновенно создает 200 000 мл сжатого воздуха. Это может показаться много, но сколько раз вы видели заряженного крипера? Вам нужно, чтобы он был поражен молнией."
    },
    {
      "type": "text",
      "text": "Чтобы увеличить вероятность этого события, вы можете соединить $(item)Железные прутья/$ с этим устройством, которые действуют как проводник молнии.$(p)Рекомендуется создать большую $(thing)сеть/$ из Железных прутьев: они могут быть на расстоянии до 5 блоков горизонтально (в радиусе), и до 5 блоков выше или ниже, но все они должны быть соединены с $(item)Электростатическим Компрессором/$ друг с другом."
    },
    {
      "type": "image",
      "images": [
        "pneumaticcraft:textures/patchouli/electrostatic_compressor.png"
      ]
    },
    {
      "type": "text",
      "text": "Обратите внимание, что на изображении слева только центральный компрессор имеет достаточно большую сеть вокруг него для максимальной эффективности; у других компрессоров будет меньшая вероятность вызова молнии (но это все равно более эффективно, чем если бы был только один компрессор посередине сети)."
    },
    {
      "type": "text",
      "text": "При использовании нескольких $(item)Электростатических Компрессоров/$ на $(thing)сети/$, воздух от удара молнии будет равномерно распределен между ними.$(p)Чтобы предотвратить взрыв компрессора, когда давление становится слишком высоким после удара, вы можете соединить $(item)Железные прутья/$ снизу компрессора. Таким образом, энергия будет разряжена в землю, а не в сам компрессор."
    },
    {
      "type": "text",
      "text": "Это разрядка происходит только тогда, когда опасное давление в компрессоре достигнуто, а не раньше. Каждое $(item)Железное прутье/$, находящееся прямо под компрессором (на одной высоте по оси Y), рассеивает 10 000 мл избыточного воздуха.$(p)Таким образом, при использовании 10 компрессоров на общей $(thing)сети/$, достаточно 2-х Железных прутьев снизу каждого компрессора. (Вы также можете добавить $(l:base_concepts/upgrades#security)Обновления Безопасности/$ для компрессора, но это более дорого и менее эффективно)"
    },
    {
      "type": "text",
      "text": "Чтобы увеличить вероятность удара молнии, вы также можете разместить до 10 $(item)Железных прутьев/$ непосредственно $(italic)над/$ компрессором, чтобы создать $(thing)молниеотвод/$. Каждое прутье немного увеличит вероятность удара молнии."
    },
    {
      "type": "text",
      "text": "$(bold)Примечание:/$ в отличие от предыдущих версий $(pncr), естественные молнии не добавляют воздух в компрессор (это было слишком злоупотребимо с использованием других модов для создания молнии). Вместо этого компрессор имеет небольшой шанс создать \"фальшивую\" молнию. Этот шанс $(italic)очень/$ мал в ясную погоду, но увеличивается во время $(thing)дождя/$ и значительно увеличивается во время $(thing)грозы/$."
    },
    {
      "type": "crafting",
      "text": "Крафт $(item)Электростатического Компрессора/$",
      "recipe": "pneumaticcraft:electrostatic_compressor"
    }
  ]
}
