{
  "name": "Термальный Компрессор",
  "icon": "pneumaticcraft:thermal_compressor",
  "category": "pneumaticcraft:compressors",
  "advancement": "pneumaticcraft:pressure_tube",
  "pages": [
    {
      "type": "text",
      "text": "$(item)Термальный Компрессор/$ - это простой компрессор, который использует $(l:base_concepts/heat)температурный/$ градиент на противоположных (горизонтальных) сторонах для производства $(l:base_concepts/pressure)сжатого воздуха/$. Чем больше температурный градиент, тем больше воздуха производится.$(p)Примечание: попытка запустить этот компрессор только с помощью $(l:machines/vortex_tube)Вихревой Трубы/$ не сработает; вы получите чистый потерю давления."
    },
    {
      "type": "image",
      "images": [
        "pneumaticcraft:textures/patchouli/thermal_compressor.png"
      ],
      "border": "true",
      "text": "$(italic)Термальный Компрессор, использующий лаву и упакованный лед для создания температурного градиента/$"
    },
    {
      "type": "text",
      "text": "Север-Юг и Восток-Запад лица $(item)Термального Компрессора/$ связаны термически друг с другом, но нет перекрестной связи между С-Ю или В-З, так что вы можете иметь два независимых температурных градиента на одном компрессоре.$(p)Тепло равномерно распределяется по всем связям, поэтому для поддержания полезного температурного градиента потребуется некоторые усилия."
    },
    {
      "type": "text",
      "title": "Применения",
      "text": "Существуют три основные ситуации, когда $(item)Термальный Компрессор/$ может быть полезен:$(li)Использование отходящего тепла (или холода!) с $(italic)одной/$ стороны $(item)Вихревой Трубы/$. Обычно вы используете только горячую или холодную сторону Вихревой Трубы, и выпускаете вторую сторону через $(l:machines/heat_sink)Теплообменник/$. Однако $(item)Термальный Компрессор/$ предоставляет возможность использовать некоторую часть этого отходящего тепла или холода для создания давления."
    },
    {
      "type": "text",
      "title": "Применения (продолжение)",
      "text": "$(li)Использование отходящего тепла от продвинутых компрессоров, таких как $(l:compressors/advanced_air_compressor)Улучшенный Компрессор Воздуха/$. Обычно вы избавляетесь от этого тепла в атмосферу, используя один или несколько $(l:tools/heat_sink)Теплообменников/$, но с помощью Термального Компрессора можно также использовать часть этого отходящего тепла для создания давления."
    },
    {
      "type": "text",
      "title": "Применения (продолжение)",
      "text": "$(li)Если у вас есть возможность получить большие объемы естественно горячих или холодных веществ, например $(l:base_concepts/heat_sources)лава или блоки из других модов/$, вы можете использовать их для создания давления. Вероятно, вам также потребуется автоматизировать размещение и удаление тепловых источников; $(l:tools/drone)Дроны/$ могут справиться с этим, а также множество других модификаций."
    },
    {
      "type": "text",
      "title": "Управление через Redstone",
      "text": "Этот компрессор может быть управляем с помощью $(#f00)Redstone сигнала/$; если он выключен, производство давления останавливается, и термическое сопротивление между Север-Юг и Восток-Запад значительно увеличивается (небольшое количество тепла все равно будет передаваться, но гораздо меньше, чем когда компрессор работает). Это может быть полезно, чтобы накопить энергию в виде теплового градиента, когда давление не требуется, например, когда ваша трубная сеть полностью находится под давлением."
    },
    {
      "type": "crafting",
      "text": "Создание $(item)Термального Компрессора/$",
      "recipe": "pneumaticcraft:thermal_compressor"
    }
  ]
}
