{
    "name": "Планшет Амадрона",
    "icon": "pneumaticcraft:amadron_tablet",
    "category": "pneumaticcraft:tools",
    "advancement": "pneumaticcraft:plastic",
    "pages": [{
            "type": "text",
            "text": "$(item)Планшет Амадрона/$ - это предмет, который можно использовать для $(thing)заказа/$ предметов и жидкостей для доставки с помощью $(l:tools/drone)дронов/$.$(p)Для этого нужно выбрать инвентарь и/или емкость для жидкости, щелкнув правой кнопкой мыши с планшетом, чтобы привязать его. Этот инвентарь/емкость затем используется для принятия предметов в качестве оплаты и получения заказанных предметов."
        },
        {
            "type": "text",
            "text": "Интерфейс планшета достаточно умный, чтобы определить, что вы можете купить, посмотрев на привязанный инвентарь и/или емкость. Когда вы заказываете $(ttcolor)$(t:Ресурсы могут быть предметами или жидкостями)ресурсы/$, появляется $(thing)дрон/$ для сбора ресурсов, которые вы используете в качестве оплаты. Как только сбор завершен, прибывает второй $(thing)дрон/$, чтобы доставить купленные предметы.$(p)Это способ получить предметы, которые вы не можете получить иначе, например $(l:components/pcb_blueprint)Печатная плата для ППК/$ и $(l:manufacturing/assembly_programs)Программы сборки/$. Также добавляются случайные $(thing)Сделки с жителями/$; эти сделки переосмысливаются каждый день."
        },
        {
            "type": "text",
            "title": "Торговля между игроками",
            "text": "Нажав кнопку $(bold)Свои специальные сделки/$ (во вкладке $(bold)Специальные сделки/$), вы можете предложить свои ресурсы для обмена на ресурсы других игроков. В интерфейсе торговли вы можете выбрать ресурс, который вы хотите продать, на левой стороне, и ресурс, который вы хотите купить, на правой стороне. Вы можете установить количество ресурсов в текстовых полях."
        },
        {
            "type": "text",
            "text": "Вы также можете указать в интерфейсе, откуда вы хотите предоставить ресурсы, и где вы хотите получить оплату от других игроков. Для этого вам потребуется $(l:tools/gps_tool)GPS Tool/$ (установленный в нужное место).$(p)Если вы не указываете специальные местоположения, то для обычных сделок будут использоваться местоположения по умолчанию, хранящиеся в планшете."
        },
        {
            "type": "text",
            "text": "Когда все готово, кнопка $(bold)Добавить сделку/$ станет активной. Эта сделка будет видна другим игрокам в их $(item)Планшете Амадрона/$, так же, как и любые обычные предложения.$(p)Важное отличие состоит в том, что запас ограничен: вы должны добавить свои ресурсы в инвентарь/емкость продажи. Прибудет $(thing)дрон/$ для забора этих ресурсов; когда забор завершен, запас будет увеличен. Уровни запасов для специальных предложений отображаются в интерфейсе $(item)Планшета Амадрона/$."
        },
        {
            "type": "text",
            "text": "Другие игроки теперь могут принять предложение в пределах доступного запаса. Когда игрок принимает предложение, вы получите уведомление (если вы в сети), и $(thing)дрон/$ прибудет, чтобы доставить вам ресурсы, которыми вас заплатил другой игрок. Сделка завершена!"
        },
        {
            "type": "text",
            "text": "Нажатием кнопки $(#F00)х/$ при нажатии шифта на одной из ваших собственных сделок в интерфейсе Амадрона, сделка будет удалена, и Амадрон попытается вернуть ваши ресурсы в инвентарь/емкость, которая их предоставила. $(p)$(bold)Предупреждение:/$ Амадрон не несет ответственности за потерянные ресурсы в случае проблем с их возвратом!"
        },
        {
            "type": "crafting",
            "text": "Создание Планшета Амадрона",
            "recipe": "pneumaticcraft:amadron_tablet"
        }
    ]
}