{
    "name": "Микроракеты",
    "icon": "pneumaticcraft:micromissiles",
    "category": "pneumaticcraft:tools",
    "advancement": "pneumaticcraft:printed_circuit_board",
    "pages": [{
            "type": "text",
            "text": "$(item)Микроракеты/$ - это маленькие ручные ракеты с взрывным зарядом и умным нацеливанием на мобов. Чтобы выпустить $(item)микроракету/$, просто $(thing)щелкните правой кнопкой мыши/$ по ракетному модулю. По умолчанию каждый модуль содержит 100 ракет.$(p)Микроракеты ищут цели в радиусе 24 блока сферически вокруг ракеты. Как только подходящая цель найдена, ракета повернется к этой цели."
        },
        {
            "type": "entity",
            "entity": "pneumaticcraft:micromissile",
            "offset": "-0.3",
            "text": "$(italic)Маленькие, но смертоносные/$"
        },
        {
            "type": "text",
            "text": "$(item)Микроракеты/$ никогда не будут нацеливаться на игрока, который выпустил ракету, или на какие-либо сущности (питомцы, дроны...), принадлежащие этому игроку. Но будьте осторожны с ущербом от ближайших взрывов: не рекомендуется использовать в ближнем бою!$(p)$(item)Микроракеты/$ могут нацеливаться на живые сущности, вагоны и лодки, но не будут нацеливаться на предметы или другие неодушевленные сущности, такие как картины."
        },
        {
            "type": "text",
            "text": "Если $(item)Микроракета/$ попадает в какую-либо сущность или блок, она мгновенно взорвется. По умолчанию взрыв не повреждает окружающую среду $(ttcolor)$(t:См. параметр 'B:damageTerrain' в конфигурации мода)/$.$(p)$(item)Микроракеты/$ имеют ограниченное время полета, которое составляет 300 тиков (15 секунд) $(ttcolor)$(t:См. параметр 'I:missileLifetime' в конфигурации мода)/$ . После этого ракета иссякает топливо и упадет с неба, но всё равно взорвется при ударе о землю."
        },
        {
            "type": "text",
            "text": "Если вы прицеливаетесь прямо в подходящую сущность при стрельбе, выпущенная $(item)Микроракета/$ мгновенно нацелится на эту сущность, независимо от того, что ближе.$(p)Если $(thing)щелкните правой кнопкой мыши/$ по ракетному модулю, откроется интерфейс, позволяющий настраивать несколько свойств ракет:$(li)Треугольник выбора позволяет настроить баланс между максимальной скоростью, скоростью поворота и силой взрыва."
        },
        {
            "type": "text",
            "text": "$(li)Вы можете выбрать режим $(thing)Умный/$ или $(thing)Тупой/$: в режиме $(thing)Умный/$ ракеты будут нацеливаться на цели, как описано выше, а в режиме $(thing)Тупой/$ ракеты будут просто лететь по прямой линии до столкновения с чем-либо, но с хорошей скоростью и силой взрыва.$(li)Вы можете фильтровать цели, которых атакует ракета, указав $(l:base_concepts/entity_filter)фильтр сущностей/$ в поле $(bold)Фильтр сущностей/$."
        },
        {
            "type": "text",
            "text": "$(li)Кнопка $(bold)Сохранить по умолчанию/$ позволяет сохранить текущие настройки и использовать их для всех новых ракетных модулей. Примечание: настройки сохраняются на стороне сервера."
        },
        {
            "type": "crafting",
            "recipe": "pneumaticcraft:micromissiles",
            "text": "Создание Микроракет"
        }
    ]
}