{
  "name": "Емкость для травления",
  "icon": "pneumaticcraft:etching_tank",
  "category": "pneumaticcraft:manufacturing",
  "advancement": "pneumaticcraft:etchacid_bucket",
  "pages": [
    {
      "type": "text",
      "text": "$(thing)Емкость для травления/$ сначала должна быть заполнена $(l:manufacturing/etching_acid)Травящей Кислотой/$. Затем вставьте до 25 $(thing)Пустых печатных плат/$, которые уже были частично или полностью облучены в $(l:manufacturing/uv_light_box)УФ-ящике/$.$(p)Хотя вы можете просто вылить Травящую Кислоту в мир и бросить Пустые платы в эту жидкость, использование Емкости для травления намного безопаснее и быстрее способ сделать это."
    },
    {
      "type": "text",
      "title": "Автоматизация",
      "text": "Вы можете подавать $(thing)Пустые печатные платы/$ с любой стороны. Успешно обработанные $(thing)Несобранные платы/$ перемещаются в правый верхний слот для вывода, тогда как $(thing)Поврежденные платы/$ попадают в нижний правый слот. Для автоматического извлечения изделий, извлекайте Несобранные платы с боковой стороны машины, а Поврежденные платы - сверху или снизу. Вы можете автоматизировать этот процесс, направив Поврежденные платы в $(thing)Доменную печь/$, чтобы получить необлученные Пустые печатные платы обратно и начать процесс заново."
    },
    {
      "type": "text",
      "title": "Нагревание",
      "text": "Без $(l:base_concepts/heat)тепла/$, Емкость для травления занимает 150 секунд, чтобы полностью обработать печатную плату (хотя, конечно же, до 25 плат могут обрабатываться параллельно). Если вы нагреваете емкость, вы можете дополнительно сократить время обработки до минимума - 30 секунд; чем горячее емкость, тем быстрее время обработки. Однако имейте в виду, что при нагревании небольшое количество Травящей Кислоты будет использовано во время обработки печатных плат."
    },
    {
      "type": "crafting",
      "text": "Изготовление Емкости для травления",
      "recipe": "pneumaticcraft:etching_tank"
    }
  ]
}
