{
  "name": "Загрузка Чанков",
  "icon": "minecraft:ender_eye",
  "category": "pneumaticcraft:base_concepts",
  "pages": [
    {
      "type": "text",
      "text": "Это основной механизм Minecraft, который загружает в память только части мира. Это необходимо для обеспечения производительности; ни один доступный компьютер не смог бы загружать и обрабатывать весь мир (особенно модифицированный) одновременно. Мир разделен на $(thing)чанки/$ размером 16x16 (по горизонтальным осям), из которых одновременно загружается только несколько."
    },
    {
      "type": "text",
      "text": "Это имеет важные последствия для создания надежных модифицированных конструкций; если вы хотите, чтобы обработка происходила, когда вы не в своей базе, вам нужно $(thing)загрузить чанки/$ с соответствующими машинами. Следующая информация прежде всего предназначена для достижения надежных конструкций в $(pncr), но многие из этих советов применимы и к другим модам."
    },
    {
      "type": "text",
      "title": "Методы загрузки чанков",
      "text": "$(li)В Vanilla есть команда $(thing)/forceload/$ для загрузки одного или нескольких чанков постоянно, но для использования этой команды требуются права оператора$(li)Многие моды предлагают решения для загрузки чанков, которые можно использовать игроками, например $(thing)FTB Chunks/$, $(thing)Chicken Chunks/$, $(thing)Weirding Gadgets/$ и другие.$(li)Программируемый контроллер из этого мода также предлагает некоторую ограниченную функциональность загрузки чанков."
    },
    {
      "type": "text",
      "title": "Безопасность при загрузке чанков",
      "text": "Следующие советы помогут создавать надежные системы с загруженными чанками:$(li)$(thing)Постарайтесь размещать ваши конструкции в пределах чанков/$. Если часть вашей конструкции загружена, а часть нет, результаты могут быть непредсказуемыми. Пусть все или ничего будет загружено.$(li)$(thing)Используйте улучшения безопасности в машинах./$ Это предотвращает взрывы; даже с хорошим управлением красным камнем, загрузкой чанков или проблемами производительности сервера могут возникать проблемы."
    },
    {
      "type": "text",
      "title": "Безопасность при загрузке чанков (продолжение)",
      "text": "$(li)$(thing)Держите мультблоки в пределах одного чанка, если возможно./$ Даже если все соответствующие чанки загружены, не идеально, чтобы мультблоки, такие как $(l:manufacturing/pressure_chamber)Камера Давления/$, охватывали два или более чанка."
    }
  ]
}